cmsis-svd/cmsis-svd/data/Atmel/ATSAMR21E18A.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="TCC0">
      <name>TCC1</name>
      <description>Timer Counter Control 1</description>
      <baseAddress>0x42002400</baseAddress>
      <interrupt>
        <name>TCC1</name>
        <value>16</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TCC0">
      <name>TCC2</name>
      <description>Timer Counter Control 2</description>
      <baseAddress>0x42002800</baseAddress>
      <interrupt>
        <name>TCC2</name>
        <value>17</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <version>1.0.1</version>
      <description>Universal Serial Bus</description>
      <groupName>USB</groupName>
      <prependToName>USB_</prependToName>
      <baseAddress>0x41005000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB</name>
        <value>7</value>
      </interrupt>
      <registers>
       <cluster>
        <name>DEVICE</name>
        <description>USB is Device</description>
        <headerStructName>UsbDevice</headerStructName>
        <addressOffset>0x0</addressOffset>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x000</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>DEVICE</name>
                  <description>Device Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>Host Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DESCADD</name>
          <description>Descriptor Address</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DESCADD</name>
              <description>Descriptor Address Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>DEVICE Control B</description>
          <addressOffset>0x008</addressOffset>
          <size>16</size>
          <resetValue>0x0001</resetValue>
          <fields>
            <field>
              <name>DETACH</name>
              <description>Detach</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPDCONF</name>
              <description>Speed Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SPDCONFSelect</name>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>FS : Full Speed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>LS : Low Speed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x2</name>
                  <description>HS : High Speed capable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3</name>
                  <description>HSTM: High Speed Test Mode (force high-speed mode for test mode)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NREPLY</name>
              <description>No Reply</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTJ</name>
              <description>Test mode J</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTK</name>
              <description>Test mode K</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTPCKT</name>
              <description>Test packet mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPMODE2</name>
              <description>Specific Operational Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GNAK</name>
              <description>Global NAK</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMHDSK</name>
              <description>Link Power Management Handshake</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>LPMHDSKSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No handshake. LPM is not supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>ACK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NYET</name>
                  <description>NYET</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <description>STALL</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DADD</name>
          <description>DEVICE Device Address</description>
          <addressOffset>0x00A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DADD</name>
              <description>Device Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>ADDEN</name>
              <description>Device Address Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPINTSMRY</name>
          <description>DEVICE End Point Interrupt Summary</description>
          <addressOffset>0x020</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EPINT0</name>
              <description>End Point 0 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT1</name>
              <description>End Point 1 Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT2</name>
              <description>End Point 2 Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT3</name>
              <description>End Point 3 Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT4</name>
              <description>End Point 4 Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT5</name>
              <description>End Point 5 Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT6</name>
              <description>End Point 6 Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT7</name>
              <description>End Point 7 Interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FNUM</name>
          <description>DEVICE Device Frame Number</description>
          <addressOffset>0x010</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MFNUM</name>
              <description>Micro Frame Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FNUM</name>
              <description>Frame Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FNCERR</name>
              <description>Frame Number CRC Error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>DEVICE Device Interrupt Enable Clear</description>
          <addressOffset>0x014</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SUSPEND</name>
              <description>Suspend Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSOF</name>
              <description>Micro Start of Frame Interrupt Enable in High Speed Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF</name>
              <description>Start Of Frame Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORST</name>
              <description>End of Reset Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake Up Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORSM</name>
              <description>End Of Resume Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMACER</name>
              <description>Ram Access Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMNYET</name>
              <description>Link Power Management Not Yet Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMSUSP</name>
              <description>Link Power Management Suspend Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>DEVICE Device Interrupt Enable Set</description>
          <addressOffset>0x018</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SUSPEND</name>
              <description>Suspend Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSOF</name>
              <description>Micro Start of Frame Interrupt Enable in High Speed Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF</name>
              <description>Start Of Frame Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORST</name>
              <description>End of Reset Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake Up Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORSM</name>
              <description>End Of Resume Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMACER</name>
              <description>Ram Access Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMNYET</name>
              <description>Link Power Management Not Yet Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMSUSP</name>
              <description>Link Power Management Suspend Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>DEVICE Device Interrupt Flag</description>
          <addressOffset>0x01C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SUSPEND</name>
              <description>Suspend</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSOF</name>
              <description>Micro Start of Frame in High Speed Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF</name>
              <description>Start Of Frame</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORST</name>
              <description>End of Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake Up</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORSM</name>
              <description>End Of Resume</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMACER</name>
              <description>Ram Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMNYET</name>
              <description>Link Power Management Not Yet</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMSUSP</name>
              <description>Link Power Management Suspend</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>DEVICE Status</description>
          <addressOffset>0x00C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Speed Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SPEEDSelect</name>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>Full-speed mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>High-speed mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x2</name>
                  <description>Low-speed mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINESTATE</name>
              <description>USB Line State Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>LINESTATESelect</name>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>SE0/RESET</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>FS-J or LS-K State</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x2</name>
                  <description>FS-K or LS-J State</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPCFG%s</name>
          <description>DEVICE End Point Configuration</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EPTYPE0</name>
              <description>End Point Type0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EPTYPE1</name>
              <description>End Point Type1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>NYETDIS</name>
              <description>NYET Token Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
